{
  "card_name": "Citi PremierMiles Card + Citi Wealth First Account",
  "card_type": "Rewards Bundle",
  "issuer": "Citi",
  "rewards_and_benefits": {
    "key_features": [
      "Introducing our groundbreaking all-in-one bundle: Citi PremierMiles Card + Citi Wealth First Account Bundle, offering seamless financial empowerment and unparalleled travel rewards in one effortless application process.",
      "Get more attractive gift incentives when you sign up for the Bundle",
      "Citi PremierMiles Card:",
      "Earn up to 2.2 Citi Miles per S$1 when you spend on your Citi PremierMiles Card",
      "Earn up to 10 Citi Miles per S$1 on online travel bookings via Kaligo and Agoda",
      "Citi Miles never expire",
      "Principal Cardholder gets to enjoy 2 complimentary visits every year to over 1,300 airport lounges worldwide.",
      "Receive renewal bonus of 10,000 Citi Miles on your Card anniversary",
      "Citi Wealth First Account:",
      "Get wealth management advice and solutions from a dedicated Relationship Manager and team of wealth specialists",
      "Receive in-depth global market insights and research knowledge from a team of over 350+ research analysts",
      "Enjoy fully personalised wealth management solutions with Citigold's Total Wealth Advisor",
      "Enjoy zero foreign exchange conversion fees and administrative charges at all Citibank ATMs worldwide",
      "Citigold status is maintained at Citibank branches overseas",
      "No funding into your Citi Wealth First Account is required to be eligible for the MoneySmart Promotion."
    ],
    "air_miles": [
      "1.2 Citi Miles per S$1 local spend. No minimum spend, although general exclusions such as insurance, educational institution fees etc., do apply",
      "2.2 Citi Miles per S$1 overseas spend on foreign currency. Subject to 3.25% admin fee per transaction",
      "Citi Miles never expire so you can accumulate them over time",
      "Citi Miles conversion rate: 10,000 Miles miles for 10,000 airline miles/hotel points",
      "Citi Miles redemption via Citi ThankYouSM Rewards allows you to transfer miles earned to 11 airline partners, including Singapore Airlines’ Krisflyer miles program. Subject to S$25 + prevailing GST per Points Transfer"
    ],
    "overseas_spending": [
      "Earn 2.2 Citi Miles per S$1 overseas spend charged in foreign currency",
      "No minimum spend nor cap",
      "Online travel bookings charged in foreign currency: Earn 7 Citi Miles per S$1 overseas spend with Agoda’s Bonus Miles promotion; earn 10 Citi Miles per S$1 overseas spend with Kaligo’s Bonus Miles promotion",
      "All foreign currency transactions subject to 3.25% admin fee"
    ],
    "bill_payment": [
      "Manage and schedule bill payments with Citi PayAll feature on the Citi Mobile App",
      "With Citi PayAll, you can earn and accumulate Citi Miles, Citi ThankYou PointsSM or Cash Back quickly when you pay your big-ticket bills such as rent, insurance premiums, education expenses, taxes, utilities and more"
    ],
    "petrol": [
      "Esso: 5% Esso site discount + 5% Esso Smiles discount + 4% Citi card discount = Total of 14% savings effectively",
      "Shell: 5% Shell site discount + 5% Shell Escape discount + 4% Citi card discount = Total of 14% savings effectively"
    ]
  },
  "eligibility": [
    "Minimum age 18 years old",
    "Promotion is valid from 01-March-2025 to 31-March-2025",
    "To be eligible for this bundle, Customers: \n- Must be a New-to-Citibank card holders\n- Must not have a primary Banking Account with Citi in the last 13 months.",
    "- Must be a New-to-Citibank card holders",
    "- Must not have a primary Banking Account with Citi in the last 13 months.",
    "Customers need to apply through MoneySmart to be eligible"
  ],
  "fees": {
    "annual_fee": "S$196.20",
    "supplementary_card_fee": "S$98.10",
    "interest_free_period": "25 days",
    "annual_interest_rate": "27.9%",
    "late_payment_fee": "Determined by credit card issuer",
    "minimum_monthly_repayment": "1% plus 1% of any outstanding unbilled instalment amounts plus interest charges plus late payment charge or S$50, whichever is higher",
    "foreign_transaction_fee": "3.25%",
    "cash_advance_fee": "8% or S$15, whichever is higher",
    "overlimit_fee": "S$40"
  },
  "minimum_income": {
    "singaporean_pr": "30,000",
    "non_singaporean": "42,000"
  },
  "documents_required": {
    "sg_citizens_prs": "Apply via MyInfo",
    "passport_validity": "6 months",
    "work_permit_validity": "6 months",
    "utility_bill": "With Full Name and Address",
    "income_tax_notice": "Income Tax Notice of Assessment",
    "payslip": "Latest Original Computerised Payslip"
  },
  "card_association": "Mastercard"
}