{
    "Wholesale of livestock, meat, poultry, eggs and seafood (including fresh and frozen)": "NA",
    "Wholesale of textiles and leathers": "NA",
    "Other business support service activities (e.g. administration of loyalty programmes)": "NA",
    "Retail sale of clothing for adults": "shopping",
    "Real estate developers": "NA",
    "Retail sale of textiles": "shopping",
    "Stalls (including pushcarts) selling uncooked food": "groceries",
    "Tailoring and dressmaking (to individual order)": "others",
    "Mini-marts, convenience stores and provision shops": "groceries",
    "Training courses for wholesale trade, logistics and transport": "NA",
    "Book-keeping services (excluding online marketplaces)": "NA",
    "Wholesale of marine equipment and accessories (including marine navigational equipment and radar)": "NA",
    "Process and industrial plant engineering design and consultancy services": "NA",
    "Wholesale of sporting goods and equipment (including bicycles and healthcare equipment)": "NA",
    "Manufacture and repair of engines and turbines except aircraft, vehicle, cycle and marine engines": "NA",
    "Restaurants": "dining",
    "Wholesale of scrap, junk and waste dealers": "NA",
    "Manufacture of other food products n.e.c. (except food chemicals and additives)": "NA",
    "Wholesale of food, beverages and tobacco n.e.c. (including dried or canned)": "NA",
    "Repair and maintenance of motor vehicles (including installation of parts & accessories)": "others",
    "Retail sale of paints": "shopping",
    "Electrical works": "others",
    "Retail sale of motorcycles and scooters": "others",
    "Wholesale trade of a variety of goods without a dominant product": "NA",
    "Other personal service activities n.e.c. (excluding online marketplaces)": "others",
    "Retail sale of spectacles and other optical goods": "healthcare",
    "Manufacture of furniture and fixtures of wood (including upholstery)": "NA",
    "Manufacture of furniture and fixtures primarily of metal": "NA",
    "Printing of periodicals, books and magazines": "NA",
    "Retail sale of clothing, footwear and leather articles n.e.c.": "shopping",
    "Retail sale of audio and video equipment (e.g. radio and television sets, sound reproducing and recording equipment)": "shopping",
    "Manufacture and repair of switchgear and switchboard apparatus (including switches, circuit breakers and electrical control panels)": "NA",
    "Funeral and related activities (including embalming, cremating and cemetery services, upkeep of cemeteries)": "others",
    "Wholesale of adults' clothing": "NA",
    "Manufacture of luggage, bags, brief cases and the like": "NA",
    "Engineering design and consultancy activities n.e.c.": "NA",
    "Retail sale of furnishings (e.g. curtains, carpets, pillow cases)": "shopping",
    "Building construction n.e.c.": "NA",
    "Manufacture of bread, cakes and confectionery (excluding frozen bakery products)": "NA",
    "Renovation contractors": "others",
    "Manufacture of made-up textile articles except apparel n.e.c. (e.g. scrolls, flags and sails, banners, canvas products, cushions, pillows)": "NA",
    "Retail sale of computer games (including electronic games and video game consoles)": "shopping",
    "Freight transport by road": "NA",
    "Chinese medicine shops": "healthcare",
    "Manufacture of jewellery and related articles n.e.c. (except costume jewellery)": "NA",
    "Employment agencies (excluding domestic worker employment placement agencies and online marketplaces)": "others",
    "Retail sale of books, newspapers and stationery (including newsvendors)": "shopping",
    "Manufacture of medical research and clinical diagnostic instruments and supplies (e.g. reagents)": "NA",
    "Business representative offices": "NA",
    "Building and repairing of ships, tankers and other ocean-going vessels (including conversion of ships into off-shore structures)": "NA",
    "Travel agencies and tour operators (mainly outbound)": "travel",
    "Manufacture of malt liquors and malt (e.g. beer and stout)": "NA",
    "Wholesale of logs, sawn timber, plywood and related products": "NA",
    "Letting of self-owned or leased real estate property except food courts, coffee shops and canteens (e.g. office/exhibition space, shopping mall, self-storage facilities)": "NA",
    "Other holding companies": "NA",
    "Manufacture of soft drinks, production of mineral waters (including carbonated waters, soya bean milk, barley water, chrysanthemum water)": "NA",
    "Bank/Financial holding companies (including insurance holding company)": "NA",
    "Wholesale of metals and metal ores (e.g. steel pipes) except general hardware": "NA",
    "Wholesale of a general line (wide range) of groceries (e.g. cereals, sugar, edible oils, sauces and dairy products)": "NA",
    "Manufacture of bricks": "NA",
    "Manufacture of cement, lime and plaster": "NA",
    "Insurance agencies and agents (including financial planning services)": "NA",
    "Management consultancy services": "NA",
    "Manufacture of paints": "NA",
    "Wholesale of cosmetics and toiletries": "NA",
    "Manufacture of dies, moulds, tools, jigs and fixtures": "NA",
    "Retail sale of hardware, paint and glass n.e.c. (e.g. wood, glass, sanitary ware, Do-It-Yourself materials)": "shopping",
    "Wholesale of chemicals and chemical products n.e.c.": "NA",
    "Manufacture of plastic products n.e.c. (except plastic footwear and toys)": "NA",
    "Installation of plumbing, heating (non-electric) and air-conditioning systems": "others",
    "Stock, share and bond brokers and dealers": "NA",
    "Wholesale of audio and video equipment except electrical and electronic components (e.g. radio and television sets, sound reproducing and recording equipment)": "NA",
    "Wholesale of medicinal and pharmaceutical products (Western)": "NA",
    "Manufacture of basic chemicals n.e.c.": "NA",
    "Manufacture of other biological products and preparations for human use": "NA",
    "General warehousing": "NA",
    "Wholesale of industrial machinery and equipment (e.g. industrial crane)": "NA",
    "Manufacture of curtains, pillow cases, bed sheets and bed spreads": "NA",
    "Manufacture of industrial gases and dry ice": "NA",
    "Real estate agencies and valuation services": "others",
    "Activities of head and regional head offices; Centralised administrative offices and subsidiary management offices": "NA",
    "Rattan processing": "NA",
    "Management consultancy services for healthcare organisations": "NA",
    "Manufacture of fibreglass and fibreglass products": "NA",
    "Wholesale of medical, professional, scientific and precision equipment": "NA",
    "Manufacture of gas; distribution of gaseous fuels through mains": "NA",
    "Freight transport arrangement": "NA",
    "Retail sale of antiques and works of art": "shopping",
    "Manufacture of plastic sheet, film and articles thereof (e.g. polythene and polypropylene bags)": "NA",
    "Wholesale on a fee or commission basis (excluding online marketplaces)": "NA",
    "Manufacture of electrical household appliances (e.g. refrigerators, hot plates, toasters, food mixers, cookers, hair dryers, fans, shavers)": "NA",
    "Clinics and other general medical services (Western)": "healthcare",
    "Activities of religious organisations n.e.c.": "others",
    "Manufacture of wearing apparel except fur apparel n.e.c. (e.g. songkoks, caps, gloves and mittens, garters, handkerchiefs, raincoats, shawls and hair nets)": "NA",
    "Manufacture of wooden containers": "NA",
    "Retail sale of cameras and other photographic goods": "shopping",
    "Mobile cellular and other wireless telecommunications network operation": "utilities",
    "Research and experimental development on natural sciences n.e.c.": "NA",
    "Single/Multiple family offices activities (e.g. managing investments and trusts for a single or multiple families)": "NA",
    "Retail sale of spare parts and accessories for motor vehicles": "others",
    "Marine construction (e.g. harbours, piers, docks, wharves)": "NA",
    "Wholesale of liquor, soft drinks and beverages": "NA",
    "Wholesale of construction materials, hardware, plumbing and heating equipment and supplies n.e.c. (e.g. cement, sand)": "NA",
    "Management consultancy services n.e.c.": "NA",
    "Wholesale of security and safety equipment": "NA",
    "Trustee, fiduciary and custody services firms (including nominee companies, trustees and REIT trustees)": "NA",
    "Commodity (excluding gold) and futures brokers and dealers": "NA",
    "Pubs": "dining",
    "Manufacture of containers and boxes of paper and paperboard": "NA",
    "Manufacture of petroleum lubricating oil": "NA",
    "Training courses n.e.c.": "NA",
    "Dental services": "healthcare",
    "Roofing works (including timber carcassing)": "others",
    "Cafes": "dining",
    "Engineering design and consultancy services supporting mining, oil and gas extraction and offshore exploration activities": "NA",
    "Wholesale of basic industrial chemicals (except fertilisers)": "NA",
    "Manufacture of petrochemical primary products (e.g. olefins, aromatics, basic building blocks)": "NA",
    "Ship chandlers": "NA",
    "Wholesale of footwear": "NA",
    "Shipping companies, including chartering of ships and boats with crew (freight)": "NA",
    "Wholesale of agricultural raw materials and live animals n.e.c. (excluding tropical produce)": "NA",
    "nan": "NA",
    "Wholesale of general hardware (e.g. locks, hinges)": "NA",
    "Wholesale of telecommunications equipment (excluding handphones)": "NA",
    "Insurance brokers": "NA",
    "Wholesale of computer hardware and peripheral equipment (except cybersecurity related hardware and peripheral equipment)": "NA",
    "Wholesale of industrial, construction and related machinery and equipment n.e.c.": "NA",
    "Churches": "others",
    "General building engineering design and consultancy services": "NA",
    "Food courts, coffee shops and canteens (with mainly food and beverage income)": "dining",
    "Residential (other than town councils), commercial and industrial real estate management": "others",
    "Building and repair of pleasure crafts, lighters and boats": "NA",
    "Chartered bus services (including school buses)": "transportation",
    "Manufacture and repair of gears, gearing and driving elements": "NA",
    "Wholesale of aircraft equipment and supplies (including aeronautical equipment)": "NA",
    "Manufacture of parts and accessories for motor vehicles (e.g. engine parts, brakes, clutches, axles, gear boxes)": "NA",
    "Manufacture of corrugated paper and paperboard": "NA",
    "Specialised medical services (including day surgical centres)": "healthcare",
    "Manufacture of springs": "NA",
    "Manufacture of jewellery except costume jewellery": "NA",
    "Wholesale of structural clay and concrete products (e.g. mosaic tiles, bricks)": "NA",
    "Retail sale of furniture (including mattresses, cushions)": "shopping",
    "Retail sale of household electrical appliances and equipment (e.g. vacuum cleaners, washing machines, refrigerators)": "shopping",
    "Commercial printing (e.g. printing of brochures, cards, envelopes, labels and stationery)": "NA",
    "Other information technology and computer service activities (e.g. disaster recovery services)": "NA",
    "Installation of doors, gates, grilles and windows": "others",
    "Shipping agencies (freight)": "NA",
    "Manufacture and repair of refrigerating, air-conditioning and ventilating machinery and equipment except household refrigerators": "NA",
    "Wholesale of parts and accessories for vehicles": "NA",
    "Department stores": "shopping",
    "Retail sale of aquarium fishes (including food and accessories)": "others",
    "Retail sale of food n.e.c.": "groceries",
    "Manufacture of outer garments": "NA",
    "Processing and preserving of seafood": "NA",
    "Manufacture and repair of pumps, compressors, taps and valves n.e.c.": "NA",
    "Manufacture and repair of other general purpose machinery and equipment except electrical and electronic n.e.c.": "NA",
    "Installation of industrial machinery and equipment, mechanical engineering works": "NA",
    "Wholesale of confectionery and bakery products": "NA",
    "General reinsurance": "NA",
    "Manufacture of perfumes and fragrances": "NA",
    "Marine surveying services other than classification societies": "NA",
    "Wholesale of paper and paper products": "NA",
    "Renting of industrial machinery and equipment": "NA",
    "Hotels": "travel",
    "Other financial service activities, except insurance and pension funding activities n.e.c.": "NA",
    "Repair and servicing of aircraft and spacecraft (including aircraft engines and other parts)": "NA",
    "Manufacture of other electronic components and boards n.e.c.": "NA",
    "Development of software and applications (except games and cybersecurity)": "NA",
    "Wholesale of electronic components": "NA",
    "Manufacture of solvents": "NA",
    "Interior design services": "others",
    "Traditional/Long-only asset/Portfolio management": "NA",
    "Soil investigation, treatment and stabilisation (including grouting and guniting)": "NA",
    "Philanthropic trusts, foundations and related activities": "NA",
    "Publishing of books, brochures, musical books and other publications": "NA",
    "Wholesale of household electrical appliances and equipment (including household air-conditioners)": "NA",
    "Hostels and dormitories for students, workers and other individuals": "travel",
    "Manufacture of saddlery, harness and articles of leather n.e.c. (e.g. coin purses, key cases)": "NA",
    "Cargo surveying services": "NA",
    "General contractors (building construction including major upgrading works)": "others",
    "General cleaning services (including cleaning of public areas, offices and factories) except household cleaning and online marketplaces": "others",
    "Finance companies (with deposit taking functions)": "NA",
    "Manufacture and repair of machinery for beverage production": "NA",
    "Retail sale in other non-specialised stores n.e.c.": "shopping",
    "Retail sale of bags, luggage and travel accessories": "shopping",
    "Pest control services not in connection with agriculture": "others",
    "Manufacture of electrical machinery, apparatus, appliances and supplies (including sound or visual signalling apparatus, electrical insulators except porcelain or glass)": "NA",
    "General contractors (non-building construction)": "others",
    "Lighterage services": "NA",
    "Movie, video, television and other programme production activities n.e.c.": "NA",
    "Manufacture of metal doors, window and door frames, grilles and gratings": "NA",
    "Airline agencies (freight)": "NA",
    "Manufacture and repair of weapons and ammunition (e.g. ordnance and accessories)": "NA",
    "Other manufacturing industries n.e.c.": "NA",
    "Landscape planting, care and maintenance service activities (e.g. garden installation and maintenance, grass cutting, tree felling, pruning)": "others",
    "Wholesale of agricultural machinery, equipment and supplies": "NA",
    "Processing of natural gums n.e.c. (e.g. gum damar, jelutong)": "NA",
    "Wholesale of fuels and related products": "NA",
    "Retail sale of crockery, cutlery and kitchen utensils": "shopping",
    "Manufacture and repair of machinery and machine-tools - metal forming types (e.g. forging press, cold heading machines, press breaks)": "NA",
    "Manufacture of computers and data processing equipment except computer peripheral equipment": "NA",
    "Private security activities": "others",
    "Manufacture of networking products (e.g. routers, switches)": "NA",
    "Container depot services": "NA",
    "Other credit agencies n.e.c. (e.g. motor finance)": "NA",
    "Manufacture and repair of semiconductor assembly and testing equipment (including computer burn-in system)": "NA",
    "Production of pre-cast components": "NA",
    "Technical and vocational secondary and post-secondary non-tertiary education": "education",
    "Advertising activities": "NA",
    "Manufacture of machine tool accessories (e.g. small cutting tools, precision measuring tools and other attachments such as tool holders)": "NA",
    "Online marketplaces for travel services": "travel",
    "Manufacture of glass and glass products (including yarn of glass fibres)": "NA",
    "Wholesale of furnishings (including curtains, carpets, wallpaper)": "NA",
    "Manufacture of smart cards and related products (e.g. smart card readers)": "NA",
    "Clinics and other general medical services (Non-Western)": "healthcare",
    "Rental and leasing of cars with driver (excluding street-hail and ride-hail service providers)": "transportation",
    "Money-changing services": "NA",
    "Renting of construction and civil engineering machinery and equipment": "NA",
    "Other cleaning services n.e.c. (excluding online marketplaces)": "others",
    "Manufacture of pulp, paper and paperboard": "NA",
    "Manufacture of games and toys": "NA",
    "Manufacture of carpets and rugs": "NA",
    "Manufacture and repair of lifting and handling equipment n.e.c. (including conveying systems and industrial automated systems)": "NA",
    "Office administrative services on a fee or contract basis (e.g. billing and record keeping)": "NA",
    "Printing n.e.c.": "NA",
    "Manufacture of printers": "NA",
    "Land reclamation works": "NA",
    "Water and gas pipe-line and sewer construction": "NA",
    "Retail sale of pet birds and animals (including food and accessories)": "others",
    "Quantity surveying services": "NA",
    "Manufacture and assembly of aircraft and spacecraft (including aircraft engines and other parts)": "NA",
    "Environmental engineering design and consultancy services (except clean energy)": "NA",
    "Production of live stage presentations": "entertainment",
    "Information technology consultancy (except cybersecurity)": "NA",
    "Manufacture of briefs, singlets and other knitted or crocheted wear (e.g. pullovers, cardigans)": "NA",
    "Manufacture of disk drives (including CD-ROM drives, DVD-ROM drives, optical drives, flash drives, tape drives, solid state drives, storage subsystems)": "NA",
    "Retail sale of watches and clocks": "shopping",
    "Movie production": "NA",
    "Glass and glazing works (including mirror and shower screen installation)": "others",
    "Technical testing and analysis services (including certification of products and services)": "NA",
    "Manufacture of wooden window, door and other millwork, except prefabricated wooden building structures": "NA",
    "Electroplating and plating of metals and formed products": "NA",
    "Wholesale of transport equipment except motor vehicles and motorcycles n.e.c.": "NA",
    "Commercial schools offering higher education programmes": "education",
    "Iron and steel foundries": "NA",
    "Wholesale of motor vehicles except motorcycles and scooters": "NA",
    "Operation of sports facilities n.e.c. (e.g. bowling alleys, tennis centres, billiard halls, football stadium)": "entertainment",
    "Crane services for all industries except construction": "NA",
    "Market research and public opinion polling": "NA",
    "Manufacture of waxes and polishes and deodorising preparations": "NA",
    "Architectural services": "others",
    "Spinning, weaving and finishing of textiles": "NA",
    "Printing of continuous and fan-fold forms": "NA",
    "Retail sale of security and safety equipment": "others",
    "Data analytics, processing and related activities n.e.c.": "NA",
    "Retail sale of motor vehicles except motorcycles and scooters": "others",
    "Site preparation n.e.c.": "NA",
    "Retail sale of handphones and peripheral equipment": "shopping",
    "Captive managers": "NA",
    "Courier activities other than national post activities": "others",
    "Fitness centres and gymnasiums": "entertainment",
    "Research and experimental development on electronics (excluding medical science)": "NA",
    "Other health services n.e.c. (excluding online marketplaces)": "healthcare",
    "Manufacture of general hardware (including blacksmith shops) n.e.c. (e.g. locks and keys, hinges, clamps, hooks)": "NA",
    "Computer facilities management activities": "NA",
    "Retail sale of computer and office equipment consumables (e.g. printer cartridges)": "shopping",
    "Wholesale of books and magazines": "NA",
    "Stenographic and secretarial services": "NA",
    "Heat treatment for metals": "NA",
    "Laundry and dry cleaning services except self-operated laundries": "others",
    "Manufacture of parts and accessories for watches and clocks": "NA",
    "Infrastructure engineering design and consultancy services": "NA",
    "Manufacture and repair of marine engine": "NA",
    "Retail sale of handicrafts, collectibles and gifts": "shopping",
    "Retail sale of jewellery made from precious metals and stones": "shopping",
    "Wholesale of packaging materials": "NA",
    "Manufacture of refined petroleum products n.e.c.": "NA",
    "Manufacture and repair of lifting and hoisting machinery except electrical": "NA",
    "Manufacture of adhesives and sealants": "NA",
    "Detective and investigation activities": "others",
    "Manpower contracting services (excluding IT manpower)": "NA",
    "Captive insurance": "NA",
    "Storage for dangerous goods": "NA",
    "Other activities auxiliary to insurance and pension funding n.e.c. (e.g. activities of actuaries)": "NA",
    "Retail sale of cosmetics and toiletries (including skin care products)": "shopping",
    "Manufacture and repair of engineering and scientific instruments": "NA",
    "Ship management services": "NA",
    "Child care services for pre-school children (including infant care services)": "others",
    "Manufacture of ophthalmic goods (e.g. spectacles, contact lenses and parts)": "NA",
    "Manufacture of electronic security systems (including electronic sensors, burglar and fire alarm systems)": "NA",
    "Wholesale of other machinery and equipment n.e.c.": "NA",
    "Manufacture of printed circuit boards with electronic parts": "NA",
    "Other publishing activities (excluding online marketplaces)": "NA",
    "Retail sale of pharmaceutical and medical goods n.e.c.": "healthcare",
    "Manufacture of cards, envelopes and stationery, unprinted": "NA",
    "Industrial design activities n.e.c.": "NA",
    "Manufacture of consumer electronics": "NA",
    "Operators and charterers of barges, tugboats and bumboats (freight)": "NA",
    "Supporting services to air transport n.e.c.": "NA",
    "Activities of professional membership organisations (e.g. medical associations, law societies, accountancy bodies)": "NA",
    "Manufacture of metal caps (e.g. crown corks)": "NA",
    "Port, shipping and maritime-related consultancy services": "NA",
    "Manufacture and repair of other special purpose machinery n.e.c. (including plating equipment, industrial paint mixers and chemical mixing equipment)": "NA",
    "Manufacture of office machinery and equipment (except computers and peripheral equipment)": "NA",
    "Manufacture and repair of electric motors": "NA",
    "Retail sale of sports apparel and equipment (including bicycles, boats and healthcare equipment)": "shopping",
    "Hairdressing salons/shops (including barber shops)": "others",
    "Other specialised construction and related activities n.e.c. (excluding online marketplaces)": "others",
    "Medical laboratories (e.g. blood analysis laboratories)": "healthcare",
    "Renting and leasing of private cars without driver (excluding online marketplaces)": "transportation",
    "Manufacture and repair of machinery and machine-tools - metal cutting types (e.g. lathes, milling machines, shaping machines)": "NA",
    "Manufacture of water treatment, waste treatment and oilfield chemicals": "NA",
    "Manufacture of industrial and mechanical rubber goods": "NA",
    "Wholesale of coffee, cocoa and tea": "NA",
    "Manufacture of structural metal products n.e.c. (e.g. metal sections, corrugated sheets)": "NA",
    "Repair and maintenance of computer hardware, data processing equipment and computer peripherals": "others",
    "Wholesale of watches and clocks": "NA",
    "Installation of fire protection and security alarm systems": "others",
    "Operating of serviced apartments": "travel",
    "Manufacture of window and door screens and shades": "NA",
    "Polishing of metals and formed products": "NA",
    "Wholesale of children and infants’ clothing (including products and accessories for infants)": "NA",
    "Construction of other civil engineering projects n.e.c. (e.g. playground systems)": "others",
    "Online marketplaces for goods (including food)": "shopping",
    "Manufacture of plastic precision engineering parts": "NA",
    "Representative offices of foreign airlines": "NA",
    "Operation of sewer systems (including sewer treatment facilities)": "NA",
    "Wholesale of computer accessories (e.g. memory cards, computer cables)": "NA",
    "Exhibition organisers": "NA",
    "Social services for children and youths (e.g. youth outreach services, adoption services)": "others",
    "Manufacture and repair of agricultural and forestry machinery": "NA",
    "Manufacture of articles of concrete, cement and plaster n.e.c. (except precast concrete components)": "NA",
    "Wholesale of jewellery made from precious metals and stones": "NA",
    "Manufacture of cooked-food preparations (e.g. frozen dinners)": "NA",
    "Manufacture of computers and peripheral equipment n.e.c.": "NA",
    "Other monetary intermediation": "NA",
    "Publishing of directories and mailing lists (including financial databases)": "NA",
    "Manufacture of metal precision components": "NA",
    "Transport via pipelines": "NA",
    "Security dealings and commodity contracts brokerage activities n.e.c.": "NA",
    "Pharmacies and drug stores (Western)": "healthcare",
    "Movie, video, television and other programme post-production activities (including remastering)": "NA",
    "Other telecommunications activities n.e.c. (e.g. provision of VoIP (Voice over Internet Protocol services))": "NA",
    "Wired telecommunications network operation (including fixed-line, fibre optics, local/international PSTN and leased circuits)": "utilities",
    "Manufacture of bakery products n.e.c.": "NA",
    "Commercial schools offering general secondary and post-secondary non-tertiary education programmes": "education",
    "Wholesale of computer software (except games and cybersecurity software)": "NA",
    "Manufacture and assembly of motor vehicles": "NA",
    "Manufacture and repair of steam generators n.e.c. (except central heating hot water boilers)": "NA",
    "Manufacture of other fabricated metal products n.e.c. (including voice coil magnets)": "NA",
    "Retail sale of beverages": "groceries",
    "Aircraft chartering with operator": "travel",
    "Ship brokering services": "NA",
    "Manufacture of biscuits (including wafers and cones)": "NA",
    "Manufacture and repair of other oilfield and gasfield machinery and equipment (e.g. derricks, tool joints)": "NA",
    "Manufacture of furniture n.e.c.": "NA",
    "Wholesale of health supplements": "NA",
    "Wholesale of other household goods n.e.c.": "NA",
    "Manufacture of pharmaceutical products and preparations for human use (e.g. tableted products)": "NA",
    "Manufacture of signs and advertising displays (including neon-lighting)": "NA",
    "Manufacture of steel structural component": "NA",
    "Sandblasting/Shotblasting works (except ships)": "NA",
    "Carpark management and operation services": "transportation",
    "Retail sale of health supplements": "healthcare",
    "Manufacture of basic chemicals except fertilisers and nitrogen": "NA",
    "Airport operation services": "NA",
    "Manufacture and repair of oil rigs": "NA",
    "Publishing of news": "NA",
    "Performing arts venue operation": "entertainment",
    "Plastic product services": "NA",
    "Retail sale of computer hardware (including handheld computers) and peripheral equipment, and computer software (except games and cybersecurity hardware and software)": "shopping",
    "Domestic worker employment placement agencies (excluding online marketplaces)": "others",
    "Wholesale of lighting and lighting accessories": "NA",
    "Manufacture of metal cans, containers and related products n.e.c. (e.g. barrels, steel drums, kegs)": "NA",
    "Manufacture of wireless communications equipment (e.g. cellular phones)": "NA",
    "Manufacture and repair of measuring devices (e.g. meters)": "NA",
    "Wholesale of furniture (including mattresses, cushions)": "NA",
    "Manufacture and repair of tanks, reservoirs and containers of metal (e.g. metal cylinders, storage vessels and containers for compressed or liquefied gas)": "NA",
    "Convention/Conference organisers": "NA",
    "Manufacture and repair of water/waste water treatment equipment": "NA",
    "Manufacture of other electronic and electric wires and cables n.e.c.": "NA",
    "Manufacture and repair of electric generators": "NA",
    "Manufacture and repair of pumps (e.g. hydraulic pumps, drainage pumps)": "NA",
    "Airlines (passenger)": "travel",
    "Transaction/Payment processing services": "NA",
    "Treatment and disposal of waste (including remediation activities)": "NA",
    "Manufacture of derivatives and intermediates produced from basic building blocks (e.g. acetyls, acrylics, oxochemicals, styrene, phenolic, ethylene oxide derivatives and polymers)": "NA",
    "Wrecking and demolition works": "NA",
    "Bridge, tunnel, viaduct and expressway construction": "NA",
    "Manufacture of jams (including fruit jelly)": "NA",
    "Fund management activities n.e.c.": "NA",
    "Renting and leasing of land transport equipment (except cars) without driver n.e.c. (excluding online marketplaces)": "transportation",
    "Dramatic arts, music and other arts production-related activities n.e.c. (e.g. stage, lighting and sound services)": "entertainment",
    "Training courses for sports and games": "others",
    "Manufacture of sausage": "NA",
    "Leasing of non-financial intangible assets (e.g. patents, trade marks, brand names etc)": "NA",
    "Fast food outlets": "dining",
    "Night clubs, discotheques, dance clubs and karaoke lounges": "entertainment",
    "Service activities related to printing n.e.c. (including plate-making)": "NA",
    "Manufacture of plumbing, heating and related products (including parts) except electric": "NA",
    "Retail sale of liquefied petroleum gas (LPG)": "utilities",
    "Manufacture and repair of semiconductor foundry equipment": "NA",
    "Wholesale of office machines and equipment (including accessories)": "NA",
    "Manufacture of telecommunications apparatus (e.g. PBX equipment, telephones except cellular)": "NA",
    "Beauty salons and spas (including slimming, skin care and hair care centres)": "others",
    "Manufacture of foam rubber products (excluding foam rubber mattresses)": "NA",
    "Other activities auxiliary to financial service activities n.e.c. (e.g. mortgage advisory firms)": "NA",
    "Accounting and auditing services (excluding online marketplaces)": "NA",
    "Art and graphic design services": "others",
    "Manufacture and repair of construction machinery and parts": "NA",
    "Manufacture and assembly of bicycles, tricycles, trishaws and invalid carriages (including parts and accessories)": "NA",
    "Supermarkets and Hypermarkets": "groceries",
    "Photographic activities": "others",
    "Real estate activities on a fee or commission basis n.e.c. (excluding online marketplaces)": "others",
    "Rental and leasing of freight land transport vehicle (e.g. lorries and trucks) with driver": "NA",
    "Human resource consultancy services": "NA",
    "Manufacture of furniture of rattan and cane": "NA",
    "Structural repair contractors": "others",
    "Manufacture of pharmaceutical intermediates and fine chemicals for human use": "NA",
    "Communications and power line construction": "NA",
    "Translation services": "others",
    "Other construction installation n.e.c.": "others",
    "Beauty and other personal care services n.e.c. (excluding online marketplaces)": "others",
    "Retail sale of musical instruments and scores": "shopping",
    "Manufacture and repair of ovens, furnaces and furnace burners": "NA",
    "Manufacture and repair of machinery for food products processing": "NA",
    "Foundation works (including micropiling, conventional piling and underpinning)": "NA",
    "Research and experimental development on engineering": "NA",
    "Research and experimental development on medical science": "NA",
    "Manufacture of secondary batteries": "NA",
    "Retail sale of confectionery and bakery products (not manufactured on site)": "groceries",
    "Metal stampings except metal caps": "NA",
    "Wholesale of aquarium fishes (including food and accessories)": "NA",
    "Wholesale of medicine and herbs (other than Western)": "NA",
    "Information technology cybersecurity consultancy": "NA",
    "Retail sale of fruits and vegetables": "groceries",
    "Collection of waste": "NA",
    "Event/Concert organisers": "NA",
    "Home healthcare services": "healthcare",
    "Public relations, marketing and brand consultancy services": "NA",
    "Activities auxiliary to fund management activities (e.g. independent fund administration firms)": "NA",
    "Retail sale of games and toys": "shopping",
    "Development of computer games": "NA",
    "Scaffolding works": "others",
    "Supporting services to land transport n.e.c.": "NA",
    "Street-hail and ride-hail service providers": "transportation",
    "Manufacture and repair of lifts and escalators": "NA",
    "Refrigerated warehousing and storage": "NA",
    "Electronics-related industrial design services": "NA",
    "Manufacture of basic precious and non-ferrous metals n.e.c.": "NA",
    "Manicure and pedicure services": "others",
    "Manufacture of laminboard, particle board and other panels and boards n.e.c.": "NA",
    "Retail sale of footwear": "shopping",
    "Wholesale of petrochemical products": "NA",
    "Manufacture and repair of machinery for textile, apparel and leather production": "NA",
    "Manufacture of medical disposables and surgical supplies (e.g. test kits, syringes, tubes, fluid administration sets)": "NA",
    "Manufacture of pesticides and other agro-chemical products (including insecticides, herbicides and disinfectants)": "NA",
    "Hedge fund management": "NA",
    "Car washing and related services": "others",
    "Primary schools": "education",
    "Wholesale of bags, luggage and travel accessories": "NA",
    "Manufacture of ready-mix concrete": "NA",
    "Landscape design and landscape architecture": "others",
    "Installation and erection of building equipment (e.g. lifts, escalators, travellators)": "others",
    "Manufacture of communications equipment n.e.c.": "NA",
    "Manufacture of milk powder": "NA",
    "Fashion (including accessories) design services": "others",
    "Other information service activities n.e.c.": "NA",
    "Other professional, scientific and technical activities n.e.c.": "NA",
    "Port operators": "NA",
    "Assembly and testing of semiconductors": "NA",
    "Manufacture of telecommunications cables and wires": "NA",
    "Management of human resource functions": "NA",
    "Processing and preserving of meat and meat products n.e.c.": "NA",
    "Educational support services n.e.c. (excluding online marketplaces)": "NA",
    "Manufacture of Traditional Chinese Medicine": "NA",
    "Retail sale of costume jewellery": "shopping",
    "Manufacture of ferrous metal alloys": "NA",
    "Manufacture of tinplate cans": "NA",
    "Property fund management (including REIT management and direct property fund management)": "NA",
    "Training of pets and animals": "others",
    "Other related services (e.g. arranging for sale of natural gas)": "NA",
    "Other specialised design activities n.e.c.": "NA",
    "Wholesale of lifts, escalators and industrial and office air-conditioning equipment": "NA",
    "Manufacture of uninsulated wire (e.g. electronic component wire, bonding wire)": "NA",
    "Television programming and broadcasting (including cable, satellite, terrestrial television, internet and mobile)": "NA",
    "Repair and maintenance of office machinery and equipment": "others",
    "Other social services without accommodation n.e.c.": "others",
    "Renting of other machinery, equipment and tangible goods n.e.c. (excluding online marketplaces)": "NA",
    "Wholesale of musical instruments and scores": "NA",
    "Manufacture of optical instruments and photographic equipment n.e.c.": "NA",
    "Care services for pets and animals": "others",
    "Transport-related industrial design services": "NA",
    "Job training and vocational rehabilitation services": "others",
    "Recycling of metal waste and scrap": "NA",
    "Transmission, distribution and sale of electricity": "utilities",
    "Manufacture of discrete devices (e.g. diodes, light-emitting diodes, transistors and rectifiers)": "NA",
    "Recycling of non-metal waste n.e.c. (e.g. marine clay and oil sludge)": "NA",
    "Wholesale of photographic equipment and supplies (including binoculars)": "NA",
    "Child/Student care services for school-going children (e.g. before and after-school care centres, student care centres)": "others",
    "Manufacture of other transport equipment n.e.c. (e.g. carts, wagons)": "NA",
    "Joinery and other woodworks (e.g. laminated or parquet flooring)": "others",
    "Internet search engines": "NA",
    "Retail sale of lighting and lighting accessories": "shopping",
    "Acute hospitals": "healthcare",
    "Exhibition stand contractors": "NA",
    "Wholesale of construction equipment (e.g. concrete mixer)": "NA",
    "Recreation clubs (including country clubs)": "entertainment",
    "Airlines (freight)": "NA",
    "Renting of air transport equipment without operator (e.g. airplanes without operator)": "NA",
    "Manufacture of synthetic rubber": "NA",
    "Processing of natural gas": "NA",
    "Wholesale of paper, paper and cellophane products and stationery n.e.c.": "NA",
    "Retail sale of second-hand goods in stores": "shopping",
    "Manufacture of additives for mineral oil (e.g. lubricant and fuel additives)": "NA",
    "Short term accommodation activities other than hotels and chalets": "travel",
    "Student recruitment agencies": "NA",
    "Research and experimental development on social sciences and humanities": "NA",
    "Other specialised office support activities n.e.c.": "NA",
    "Research and experimental development on chemicals (excluding medical science)": "NA",
    "Distilling, rectifying and blending of spirits; ethyl alcohol production from fermented materials (including samsu and Chinese liquors)": "NA",
    "Manufacture of fertilisers and nitrogen compounds": "NA",
    "Retail sale of tyres and batteries": "others",
    "Wholesale of optical equipment and supplies (excluding binoculars)": "NA",
    "Excavation and earthmoving works": "NA",
    "Online marketplaces for education services": "education",
    "Wholesale of handicrafts and gifts": "NA",
    "Wedding and related activities (including bridal studios and wedding planners)": "others",
    "Retail sale of handicrafts and fancy goods, flowers, plants and pet animals n.e.c.": "others",
    "Installation of awning and window shades": "others",
    "Risk and damage evaluation (e.g. loss adjusting, claims adjusting)": "NA",
    "Rustproofing of metals and formed products": "NA",
    "Renting and leasing of other personal and household goods n.e.c. (excluding online marketplaces)": "others",
    "Manufacture and repair of packaging machinery": "NA",
    "Foreign exchange brokers and dealers": "NA",
    "Money-lending": "NA",
    "Wholesale of rubber (including rubber brokers)": "NA",
    "Manufacture and repair of polymer additive manufacturing (AM) equipment": "NA",
    "Manufacture of non-ferrous metal alloys": "NA",
    "Branches of foreign shipping lines": "NA",
    "Animation production": "NA",
    "Arbitration and mediation services (excluding online marketplaces)": "NA",
    "Manufacture of cosmetics and toiletries": "NA",
    "Community development councils and grassroots organisations": "others",
    "Manufacture of edible vegetable and animal oils and fats": "NA",
    "Trusts, funds and similar financial entities (e.g. collective portfolio investment funds (excluding those with rental income))": "NA",
    "Manufacture of medical and dental tools, instruments and supplies n.e.c.": "NA",
    "Game arcade, online game aggregator, LAN game operators and gaming centres": "entertainment",
    "Charitable and other supporting activities aimed at humanitarian work": "others",
    "Social services for persons with disabilities (e.g. day activity centres for people with disabilities)": "others",
    "Exhibition stand design services": "NA",
    "Activities of other membership organisations n.e.c.": "others",
    "Manufacture of condensed and evaporated milk (including pasteurising and bottling of fluid milk)": "NA",
    "Life insurance": "NA",
    "Manufacture and repair of electric motors, generators, transformers and electricity distribution and control apparatus n.e.c. (e.g. busbar trunking)": "NA",
    "Manufacture and repair of woodworking machinery": "NA",
    "Renting and leasing of recreational and sports goods": "entertainment",
    "Manufacture of ice-cream": "NA",
    "Collective portfolio investment funds with rental income": "NA",
    "Activities of business and employers' membership organisations": "NA",
    "Manufacture and repair of industrial robots (including Automated Guided Vehicles (AGVs))": "NA",
    "Distribution of television programmes (e.g. dramas, variety shows and documentaries)": "NA",
    "Venture capital activities": "NA",
    "Research and experimental development on environment and clean technologies (excluding biotechnology)": "NA",
    "Engineering design and consultancy services in energy management and clean energy systems": "NA",
    "Other sight-seeing cruise services (e.g. harbour and river cruises)": "travel",
    "Manufacture of sporting and athletic goods (including gym, diving and underwater equipment)": "NA",
    "Wholesale of commercial food service equipment (e.g. hotel kitchen equipment)": "NA",
    "Renting of water transport equipment without operator (e.g. commercial boats and ships without operator)": "NA",
    "Manufacture of soap, detergents, washing and other cleaning preparations": "NA",
    "Retail sale of cut flowers (including wreaths)": "others",
    "Manufacture of kitchen and household utensils (e.g. steel shelf, showcase counters, kitchen trolleys display racks, sink bowls and other customised kitchen equipment)": "NA",
    "Brick laying, stone setting and cement works": "others",
    "Wholesale of electrical and wiring accessories": "NA",
    "Wholesale of cut flowers and plants": "NA",
    "Wholesale of cybersecurity software, hardware and peripheral equipment": "NA",
    "Signcraft installation": "others",
    "Manufacture of plastic bottles, boxes and containers (except for household use)": "NA",
    "Generation of electricity by other sources (e.g. solar power, biofuels etc)": "utilities",
    "Self-operated laundries": "others",
    "Movie, video, television and other programme distribution activities n.e.c.": "NA",
    "Music publishing and distribution activities": "NA",
    "Manufacture of wire and cable assemblies and harnesses": "NA",
    "Other residential care services n.e.c.": "others",
    "Satellite telecommunications network operation": "NA",
    "Manufacture of biofuels": "NA",
    "Road and railway construction": "NA",
    "Sound recording production": "NA",
    "Factoring companies": "NA",
    "Wholesale of personal effects n.e.c.": "NA",
    "Schools for special needs": "education",
    "Painting and decorating": "others",
    "Land surveying services": "NA",
    "Manufacture of plastic tableware, household and kitchen ware (excluding disposable utensils)": "NA",
    "Agrotechnology consultancy services": "NA",
    "Retail sale of specific commodities n.e.c.": "shopping",
    "Manufacture of tea (including processing of tea leaves)": "NA",
    "Manufacture of metal strips and slabs (e.g. awnings)": "NA",
    "Silk screen printing (including metal printing)": "NA",
    "Credit rating agencies": "NA",
    "Wholesale of toys and games": "NA",
    "Manufacture of chocolate and chocolate products": "NA",
    "Manufacture of grain mill products n.e.c.": "NA",
    "Examination and accreditation agencies for education services": "NA",
    "Other surveying services n.e.c. (e.g. geophysical, geologic, seismic, hydrographic surveying services)": "NA",
    "Publishing of games software/applications": "NA",
    "Collection, purification and distribution of water (including desalination of water)": "utilities",
    "Manufacture of other insulation products (e.g. ceramic IC packages, refractory materials, rock wool products, insulation services)": "NA",
    "Training courses for healthcare, education, community and social services": "NA",
    "Wholesale of tropical produce n.e.c.": "NA",
    "Import, export and credit insurance": "NA",
    "Development of software for cybersecurity": "NA",
    "Repair of footwear and leather goods": "others",
    "Manufacture of sugar and sugar products": "NA",
    "Wholesale of handphones, handphone peripheral equipment and other telecommunications equipment": "NA",
    "Financial leasing companies": "NA",
    "Social services for the elderly (e.g. befriender services, meal services, drop-in centres)": "others",
    "Food kiosks mainly for takeaway and delivery": "dining",
    "Online marketplaces for services n.e.c.": "others",
    "News agency activities": "NA",
    "Manufacture and repair of irradiation and electromedical equipment and instruments": "NA",
    "Wholesale of pepper and other spices": "NA",
    "Wholesale of crockery, cutlery and kitchen utensils": "NA",
    "Training courses for food and beverage, retail and accommodation, tour operators, travel agencies & travel-related reservation services": "NA",
    "International cruise services": "travel",
    "Wholesale of motorcycles and scooters": "NA",
    "Residential care services for children (e.g. children’s homes, orphanages)": "others",
    "Wholesale of sporting and other recreational goods n.e.c.": "NA",
    "Manufacture of basic iron and steel n.e.c. (including smelting)": "NA",
    "Wholesale of handicrafts and fancy goods n.e.c.": "NA",
    "Associations for hobbies, recreational, cultural and extra-curricular activities (e.g. scouts/girl guides association, book clubs and photo, music, art and craft clubs)": "others",
    "Amusement theme parks": "entertainment",
    "Manufacture and repair of electrotherapeutic devices": "NA",
    "Training courses for information and communications, finance and professional services": "NA",
    "Brokerage and consultancy services of intellectual property assets": "NA",
    "Manufacture and assembly of motorcycles and scooters (including engines and other parts and accessories)": "NA",
    "Manufacture of clay products n.e.c.": "NA",
    "Manufacture of printed circuit boards without electronic parts": "NA",
    "Other related services (e.g. electricity brokers, meter reading)": "NA",
    "Metal product services n.e.c.": "NA",
    "International and foreign system schools": "education",
    "Gold bullion brokers and dealers": "NA",
    "Manufacture of coffee powder": "NA",
    "Repair of communications equipment (e.g. mobile phones and fax machines)": "others",
    "Training courses for construction, real estate, security and investigation services, cleaning, landscaping, waste management and pest management": "NA",
    "Manufacture of biological products and preparations for veterinary use": "NA",
    "Manufacture of photographic equipment and parts (including lenses)": "NA",
    "Chalets": "travel",
    "Manufacture of other non-metallic mineral products n.e.c. (e.g. graphite products)": "NA",
    "Orchestras, musical bands, choirs and dance groups": "entertainment",
    "Manufacture of instant beverages": "NA",
    "Manufacture of food chemicals and additives (e.g. flavours, preservatives and colourings)": "NA",
    "Retail sale of joss paper and other ceremonial products": "others",
    "Manufacture of other articles of paper and paperboard n.e.c. (e.g. papier mache, wallpaper)": "NA",
    "Manufacture of other rubber products n.e.c. (except rubber footwear and toys)": "NA",
    "Manufacture of paper cups, plates and utensils": "NA",
    "Manufacture and repair of metal additive manufacturing (AM) equipment (including metal powder)": "NA",
    "Carbon credit brokers/traders": "NA",
    "Online marketplaces for health services": "healthcare",
    "Wholesale of coconut": "NA",
    "Processing of coffee seeds": "NA",
    "Manufacture and repair of service robots": "NA",
    "Manufacture of sanitary ware of enamelled iron and metal and plumbers' ware of brass": "NA",
    "Manufacture of footwear": "NA",
    "Classification societies": "NA",
    "Production of dramas, variety shows and documentaries (including production of television programme)": "entertainment",
    "Iron and steel rolling mills": "NA",
    "Duplicating and photo-copying services": "others",
    "Airport terminal services (e.g. ground service activities)": "NA",
    "Manufacture of ultrapure electronic chemicals, materials and laminates": "NA",
    "Stalls (including pushcarts) selling other commodities (other than uncooked food)": "shopping",
    "Retreading and vulcanising of tyres": "others",
    "Management of self-owned strata titled property (i.e. Management Corporation Strata Title)": "others",
    "Manufacture of vaccines for human use": "NA",
    "Residential care services for the elderly (e.g. home for the aged)": "others",
    "Manufacture of knitted and crocheted fabrics and laces": "NA",
    "Manufacture of sauces including soya bean sauce (e.g. tomato sauce, chilli sauce)": "NA",
    "Manufacture of prepared animal feeds (including additives for animal feed)": "NA",
    "Repair of watches and clocks": "others",
    "Motor vehicle towing services": "others",
    "Manufacture and repair of robots n.e.c.": "NA",
    "Carbon consultancy services": "NA",
    "Wholesale of sewing and clothing accessories (e.g. button, thread, lace, zip, belt, tie)": "NA",
    "Wholesale of computer games (including electronic games and video game consoles)": "NA",
    "Manufacture of furniture of other materials except primarily of stone, ceramic or concrete": "NA",
    "Manufacture of mechanical watches and clocks": "NA",
    "Repair of bicycles and tricycles": "others",
    "Manufacture of metal pipes and tubes": "NA",
    "Data centres": "NA",
    "Manufacture of capacitors": "NA",
    "Manufacture and repair of transformers": "NA",
    "Manufacture of starches and starch products": "NA",
    "Wholesale of costume jewellery": "NA",
    "Wholesale of antiques and works of art": "NA",
    "Dialysis services": "healthcare",
    "Specialised education schools": "education",
    "Manufacture of costume jewellery and related articles": "NA",
    "Wholesale of glass": "NA",
    "Organisations for the protection of the environment and animals": "others",
    "Manufacture of other porcelain and ceramic products n.e.c.": "NA",
    "Manufacture of other products of wood and articles of cork, straw and plaiting materials n.e.c.": "NA",
    "Public administration of economic and social programmes": "NA",
    "Slitting, shearing and pasting of metal sheeting": "NA",
    "Manufacture of wines": "NA",
    "Retail sale of artificial flowers and plants": "shopping",
    "Repair of other personal and household goods n.e.c. (excluding online marketplaces)": "others",
    "Renting and leasing of furniture, utensils and electronic equipment for household use": "others",
    "Manufacture of chips, crackers and other titbits (excluding biscuits and confectionery)": "NA",
    "Manufacture of electric power cables and wires": "NA",
    "Secondary schools including combined primary and secondary schools": "education",
    "Manufacture of solar wafers": "NA",
    "Salvaging of distressed vessels and cargos": "NA",
    "Stevedoring services": "NA",
    "Manufacture of brassieres and other undergarments": "NA",
    "Manufacture and repair of railway and tramway locomotives and rolling stock (including specialised parts except engines, electric motors and signalling equipment)": "NA",
    "Representative offices of foreign insurers and professional reinsurers": "NA",
    "Private debt funds": "NA",
    "Manufacture of plastic cable ties": "NA",
    "Repair and restoration of cabinets, furniture, upholstery, window shades and other fixtures": "others",
    "Manufacture of pipe fittings": "NA",
    "Retail sale of tobacco products": "others",
    "Repair of audio and video equipment (e.g. television sets, speakers and DVD players)": "others",
    "Manufacture of sanitary towels, toilet paper, paper towels, disposable diapers and related paper products": "NA",
    "National post activities (e.g. postal services)": "others",
    "Life reinsurance": "NA",
    "Public bus services (scheduled services)": "transportation",
    "Manufacture of joss paper and other related ceremonial paper products (including effigies and other funeral paper goods and Chinese lanterns)": "NA",
    "Manufacture of musical instruments": "NA",
    "Wholesale of music and video recordings (e.g. DVDs, Blu-ray discs)": "NA",
    "Wholesale of ice-cream": "NA",
    "Pawnbrokerage": "others",
    "Colour separation": "NA",
    "Manufacture of pharmaceutical products for veterinary use": "NA",
    "Teachers' training institute": "education",
    "Manufacture of metal wire and cable products n.e.c.": "NA",
    "Retail sale of sewing and clothing accessories (e.g. button, thread, lace, zip, belt, tie)": "shopping",
    "Manufacture of vegetable and animal oils and fats n.e.c.": "NA",
    "Training courses for manufacturing": "NA",
    "Passenger ferry services": "transportation",
    "Mass rapid transit systems (including light rail)": "transportation",
    "Manufacture of handbags": "NA",
    "Branches of foreign airlines (passenger)": "travel",
    "Wholesale banks": "NA",
    "Manufacture and repair of separation/mixing equipment (e.g. filters, separators, mixers)": "NA",
    "Marine insurance": "NA",
    "Wheat milling": "NA",
    "Activities of households as employers of domestic workers": "others",
    "Friendship, match-making and dating services": "others",
    "Mutual benefits organisations": "NA",
    "Full banks": "NA",
    "Manufacture of rubber automotive parts": "NA",
    "Non-ferrous metal foundries": "NA",
    "Radio programme production and broadcasting": "NA",
    "Botanical and zoological gardens and nature reserves activities": "entertainment",
    "Manufacture of macaroni, noodles, vermicelli and other related products": "NA",
    "Renting of VCDs and DVDs": "entertainment",
    "Tile setting and plastering": "others",
    "Manufacture and repair of heating boilers, radiators and correctors (including parts)": "NA",
    "Manufacture and repair of taps, cocks and valves": "NA",
    "Bookbinding (e.g. book packaging)": "NA",
    "Manufacture of inks, dyestuffs, pigments and carbon black": "NA",
    "Pressing and roll-forming of metal and powder metallurgy n.e.c.": "NA",
    "Preparing, canning and preserving of poultry and poultry products": "NA",
    "Manufacture of additives n.e.c.": "NA",
    "Manufacture of cordials, syrups and composite concentrates for beverages": "NA",
    "Generation of electricity by fossil fuels": "utilities",
    "Manufacture of other made-up house furnishings (e.g. napkins, table cloths)": "NA",
    "Retail sale of optical and photographic goods n.e.c.": "shopping",
    "Representative offices of foreign shipping lines": "NA",
    "Preservation of wood": "NA",
    "Manufacture of mattresses including those of foam rubber": "NA",
    "Manufacture of styrofoam and plastic disposable utensils": "NA",
    "Other canning and preserving of vegetables and vegetable juices (including pickles)": "NA",
    "Manufacture and repair of solar modules and panels": "NA",
    "Manufacture of implantables and artificial limbs (e.g. heart valves, stents, orthopaedic implants)": "NA",
    "Universities": "education",
    "Manufacture of non-dairy creamer": "NA",
    "Manufacture of varnishes and lacquers (including enamels)": "NA",
    "Renting of attire (e.g. costumes)": "others",
    "Manufacture and repair of wiring devices": "NA",
    "Manufacture of primary batteries": "NA",
    "Online marketplaces for real estate services": "others",
    "Inter-country bus services": "transportation",
    "Social escort services": "others",
    "Manufacture of military fighting vehicles": "NA",
    "Sawmilling": "NA",
    "Manufacture of cordage, rope, twine and netting": "NA",
    "Preparing, canning and preserving of livestock and livestock products (including lard and other edible animal fats)": "NA",
    "Manufacture of plywood and veneer": "NA",
    "Manufacture of leadframe": "NA",
    "Sawmilling and planing of wood n.e.c.": "NA",
    "Manufacture of piezo-electric devices (e.g. quartz crystals, quartz crystal filters, delay lines)": "NA",
    "Manufacture of coke oven products": "NA",
    "Buddhist/Taoist temples": "others",
    "Manufacture of photographic film, paper, plate and chemicals": "NA",
    "Manufacture of plumbing fixtures and fittings of vitreous china, china and earthenware (e.g. sinks, closets, bowls)": "NA",
    "Manufacture of tiles, pipes and channels (including clay roofing, wall and floor tiles, and earthen and glazed pipes)": "NA",
    "Repair of jewellery": "others",
    "Manufacture of domestic appliances n.e.c. (e.g. non-electric cooking ranges, grates, stoves)": "NA",
    "Manufacture of non-structural pre-cast components (e.g. lightweight partitions, secondary roof slabs)": "NA",
    "Manufacture of asphalt premix": "NA",
    "Student/Alumni bodies and related associations (e.g. parent-teacher associations, old boys' associations)": "others",
    "Manufacture of solar cells": "NA",
    "Manufacture of PVC files, holders and albums": "NA",
    "Renting and leasing of bicycles and inline/roller skates": "transportation",
    "Activities of households as employers of other domestic personnel (e.g. housekeepers)": "others",
    "Provision of milling services": "NA",
    "Manufacture and repair of plastic processing machinery": "NA",
    "Iron and steel and non-ferrous forgings": "NA",
    "Branches of foreign airlines (freight)": "NA",
    "Credit card services": "NA",
    "Slaughtering of livestock and poultry": "NA",
    "Manufacture of soya bean products except soya bean sauce and soya bean milk": "NA",
    "Manufacture of fuel cells": "NA",
    "Dam and drainage construction": "NA",
    "Manufacture of hand and edge tools": "NA",
    "Manufacture of pewter ware": "NA",
    "Tanning and dressing of leather; dressing and dyeing of fur": "NA",
    "Polytechnics": "education",
    "Manufacture of other textiles n.e.c. (e.g. upholstery filling)": "NA",
    "Railroad services": "transportation",
    "Production of Prefabricated Prefinished Volumetric Construction (PPVC) modules": "NA",
    "Public order and safety activities n.e.c.": "NA",
    "Manufacture of catalysts and catalyst regeneration": "NA",
    "Manufacture of cigarettes": "NA",
    "Activities of trade unions": "NA",
    "Manufacture of probe cards": "NA",
    "Manufacture of rubber floorings": "NA",
    "Processing of rubber (including processing of rubber latex)": "NA",
    "Manufacture of man-made fibres except glass": "NA",
    "Civil defence": "NA",
    "Horse-racing and other betting activities": "entertainment",
    "Manufacture of knitted and crocheted apparel n.e.c.": "NA",
    "Ethnic associations (including clan associations, huay kuans)": "others",
    "Manufacture of inedible vegetable and animal oils and fats": "NA",
    "Manufacture of other tinplate and zinc articles (e.g. pails, buckets, dustbins)": "NA",
    "Grading and packing of rubber": "NA",
    "Manufacture of bearings (including disc and ball bearings)": "NA",
    "Manufacture of socks, stockings and other hosiery": "NA",
    "Manufacture of disk media": "NA",
    "Rice milling": "NA",
    "Manufacture of electro-mechanical watches and clocks (e.g. watches and clocks with moving parts and battery)": "NA",
    "Other hospitals n.e.c. (e.g. psychiatric hospital)": "healthcare",
    "Manufacture of blank magnetic tapes, diskettes, Blu-ray technology discs, CDs, DVDs and VCDs": "NA",
    "Manufacture of basic industrial acids and alkalis": "NA",
    "Manufacture of tobacco products n.e.c. (e.g. cigars, loose tobacco)": "NA",
    "Aerial cableways (including cable car services)": "transportation",
    "Manufacture of asbestos products except asbestos paper": "NA",
    "Junior colleges and centralised pre-university institutes (post-secondary non-tertiary) including combined secondary schools and post-secondary non-tertiary schools": "education",
    "Timesharing service activities": "travel",
    "Printing of newspapers": "NA",
    "Manufacture of fully electronic watches and clocks": "NA",
    "Manufacture of bonding tools": "NA",
    "Hindu/Sikh temples": "others",
    "Casinos": "entertainment",
    "Manufacture of enamelled wires (used for winding of motors, transformers etc)": "NA",
    "Thrift and loan societies and credit associations": "NA"
  }
  